# Pandas

### Pandas
- 패널

In [1]:
# 모듈 import
import pandas as pd

## Series
- 1개의 컬럼 값으로만 1차원 데이터셋

## Data
- 

## Series
- DataFrame, Series의 고유한 키 값

In [2]:
data = ['2017', '2018', '2019', '2020']
se = pd.Series(data)
se

0    2017
1    2018
2    2019
3    2020
dtype: object

In [3]:
print(se[0])
print(se[2])

2017
2019

In [4]:
len(se)

4

In [5]:
len(se)-1

3

In [6]:
se[len(se)-1]

'2020'

### index, values

In [7]:
se.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
se.values

array(['2017', '2018', '2019', '2020'], dtype=object)

### 특정값 추출 - 인덱싱

In [9]:
se

0    2017
1    2018
2    2019
3    2020
dtype: object

In [10]:
se[0]

'2017'

In [11]:
se[3]

'2020'

In [105]:
se1 = pd.Series([1, 2, 3, 4], index=["a", "b", "c", "d"])
se1.name = "numOrder"
se1.index.name = "numName"
se1

numName
a    1
b    2
c    3
d    4
Name: numOrder, dtype: int64

### 특정 범위 추출 - 슬라이싱

In [12]:
se

0    2017
1    2018
2    2019
3    2020
dtype: object

In [13]:
se[0:3]

0    2017
1    2018
2    2019
dtype: object

In [14]:
se[:]

0    2017
1    2018
2    2019
3    2020
dtype: object

### index 이름과 columns 이름 지정하기 : name

In [15]:
data = ['2017', '2018', '2019', '2020']
se = pd.Series(data)
se

0    2017
1    2018
2    2019
3    2020
dtype: object

In [16]:
se.name = 'Year'
se

0    2017
1    2018
2    2019
3    2020
Name: Year, dtype: object

In [17]:
se.index.name = 'No'
se

No
0    2017
1    2018
2    2019
3    2020
Name: Year, dtype: object

### Series 생성시 index 지정하기

In [18]:
data = ['2017', '2018', '2019', '2020']
se = pd.Series(data, index = ['a', 'b', 'c', 'd'])
se

a    2017
b    2018
c    2019
d    2020
dtype: object

In [19]:
se['a']

'2017'

In [20]:
se['a':'d']

a    2017
b    2018
c    2019
d    2020
dtype: object

In [21]:
se.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [22]:
se.values

array(['2017', '2018', '2019', '2020'], dtype=object)

In [23]:
data = ['2017', '2018', '2019', '2020']
se = pd.Series(data)
se

0    2017
1    2018
2    2019
3    2020
dtype: object

In [24]:
se.index = ['a', 'b', 'c', 'd']
se

a    2017
b    2018
c    2019
d    2020
dtype: object

In [25]:
se['b']

'2018'

### masking

In [26]:
data = ['2017', '2018', '2019', '2020']
se = pd.Series(data, index = ['a', 'b', 'c', 'd'])
se

a    2017
b    2018
c    2019
d    2020
dtype: object

In [27]:
se > '2018'

a    False
b    False
c     True
d     True
dtype: bool

In [28]:
se[se > '2018']

c    2019
d    2020
dtype: object

In [29]:
se[-(se > '2018')]

a    2017
b    2018
dtype: object

## DataFrame
### DataFrame 생성
- Pandas에서 행과 열을 가지는 자료구조
- 데이터프레임은 2차원 이므로 행 방향 인덱스와 열 방향 인덱스가 존재
- 시리즈 : 인덱스와 값으로 구성
- 데이터 프레임 : 열, 인덱스, 값

In [30]:
import pandas as pd

In [31]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
       'score':[100, 95, 80, 85],
        'grade':['A', 'A', 'B', 'B']
       }
df = pd.DataFrame(data)
df

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     80     B
3   Choi     85     B

In [32]:
type(df)

pandas.core.frame.DataFrame

### 컬럼 순서 변경하기

In [33]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
       'score':[100, 95, 80, 85],
        'grade':['A', 'A', 'B', 'B']
       }
df = pd.DataFrame(data, columns=['name', 'grade', 'score'])
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     80
3   Choi     B     85

### index, columns, values

In [34]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [35]:
df.columns

Index(['name', 'grade', 'score'], dtype='object')

In [36]:
df.values

array([['Lee', 'A', 100],
       ['Hwang', 'A', 95],
       ['Kim', 'B', 80],
       ['Choi', 'B', 85]], dtype=object)

### 특정 컬럼 값 추출

In [37]:
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     80
3   Choi     B     85

In [38]:
df['name'].values

array(['Lee', 'Hwang', 'Kim', 'Choi'], dtype=object)

In [39]:
df['score'].values

array([100,  95,  80,  85])

In [40]:
df.loc[1, 'name']

'Hwang'

### index 이름과 columns 이름 지정하기

In [41]:
df.index.name = 'No'
df.columns.name = 'Info'
df

Info   name grade  score
No
0       Lee     A    100
1     Hwang     A     95
2       Kim     B     80
3      Choi     B     85

## DataFrame의 index 설정

- 1) DataFrame 생성시 index 설정

In [42]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
       'score':[100, 95, 80, 85],
        'grade':['A', 'A', 'B', 'B']
       }
df = pd.DataFrame(data, index = ['Lee', 'Hwang', 'Kim', 'Choi'])
df

        name  score grade
Lee      Lee    100     A
Hwang  Hwang     95     A
Kim      Kim     80     B
Choi    Choi     85     B

- 2) df.index() 이용하여 index 설정

In [43]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
       'score':[100, 95, 80, 85],
        'grade':['A', 'A', 'B', 'B']
       }
df = pd.DataFrame(data)
df

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     80     B
3   Choi     85     B

In [44]:
df.index = ['Lee', 'Hwang', 'Kim', 'Choi']
df

        name  score grade
Lee      Lee    100     A
Hwang  Hwang     95     A
Kim      Kim     80     B
Choi    Choi     85     B

In [45]:
df.drop('name', axis=1)

       score grade
Lee      100     A
Hwang     95     A
Kim       80     B
Choi      85     B

- 3) set_index() 사용하여 index 설정

In [46]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
       'score':[100, 95, 80, 85],
        'grade':['A', 'A', 'B', 'B']
       }
df = pd.DataFrame(data)
df

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     80     B
3   Choi     85     B

In [47]:
df = df.set_index('name')
df

       score grade
name
Lee      100     A
Hwang     95     A
Kim       80     B
Choi      85     B

## DataFrame 생성과 상호 변환
- DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 간의 상호 변환

### 1.1) 리스트를 이용한 DataFrame 생성

In [48]:
data = [['Lee', 100, 'A'],
       ['Hwang',95, 'A'],
       ['Kim', 80, 'B'],
       ['Choi', 85, 'B']]
df = pd.DataFrame(data, columns=['name', 'score', 'grade'])
df

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     80     B
3   Choi     85     B

### 1.2) DataFrame을 리스트로 변환

In [49]:
df.values.tolist()

[['Lee', 100, 'A'], ['Hwang', 95, 'A'], ['Kim', 80, 'B'], ['Choi', 85, 'B']]

### 2.1) 딕셔너리를 이용한 DataFrame 생성

In [50]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
             'score':[100, 95, 90, 85],
             'grade':['A', 'A', 'B', 'B']}
df = pd.DataFrame(data)
df

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     90     B
3   Choi     85     B

### 2.2) DatatFrame을 딕셔너리로 변환

In [51]:
df.to_dict()

{'name': {0: 'Lee', 1: 'Hwang', 2: 'Kim', 3: 'Choi'},
 'score': {0: 100, 1: 95, 2: 90, 3: 85},
 'grade': {0: 'A', 1: 'A', 2: 'B', 3: 'B'}}

### 3.1) ndarray를 이용한 DataFrame 생성

In [52]:
import numpy as np

In [53]:
array = np.array([['Lee', 100, 'A'],
       ['Hwang',95, 'A'],
       ['Kim', 90, 'B'],
       ['Choi', 85, 'B']])
array.shape

(4, 3)

In [54]:
df = pd.DataFrame(array, columns=['name', 'score', 'grade'])
df

    name score grade
0    Lee   100     A
1  Hwang    95     A
2    Kim    90     B
3   Choi    85     B

### 3.2) DataFrame을 ndarray로 변환

In [55]:
arr = df.values

In [56]:
arr

array([['Lee', '100', 'A'],
       ['Hwang', '95', 'A'],
       ['Kim', '90', 'B'],
       ['Choi', '85', 'B']], dtype=object)

In [57]:
type(arr)

numpy.ndarray

### 컬럼값이 없는 경우 -> NaN 처리

In [58]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
             'score':[100, 95, 90, 85],
             'grade':['A', 'A', 'B', 'B']}
c = ['name', 'grade', 'score', 'etc']
df2 = pd.DataFrame(data, columns=c)
df2

    name grade  score  etc
0    Lee     A    100  NaN
1  Hwang     A     95  NaN
2    Kim     B     90  NaN
3   Choi     B     85  NaN

## 데이터 셀렉션 및 필터링

In [59]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
             'score':[100, 95, 90, 85],
             'grade':['A', 'A', 'B', 'B']}

columns = ['name', 'grade', 'score']
df = pd.DataFrame(data, columns=columns)
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

### 1)  [ ] - df.컬럼명, df[‘컬럼명‘]

- 하나의 컬럼 검색

In [60]:
df.name

0      Lee
1    Hwang
2      Kim
3     Choi
Name: name, dtype: object

In [61]:
df['name']

0      Lee
1    Hwang
2      Kim
3     Choi
Name: name, dtype: object

- 2개 이상의 컬럼 검색

In [62]:
df[['name', 'grade']]

    name grade
0    Lee     A
1  Hwang     A
2    Kim     B
3   Choi     B

In [63]:
df[['name', 'score', 'grade']]

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     90     B
3   Choi     85     B

### 2) loc[인덱스명, 컬럼명] - 명칭(label) 기반 인덱싱

In [64]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
             'score':[100, 95, 90, 85],
             'grade':['A', 'A', 'B', 'B']}

columns = ['name', 'grade', 'score']
df = pd.DataFrame(data, columns=columns)
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

- 하나의 행 검색

In [65]:
df.loc[0]

name     Lee
grade      A
score    100
Name: 0, dtype: object

- 2개 이상의 행 검색

In [66]:
df.loc[0:2]

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90

In [67]:
df.loc[[0, 2]]

  name grade  score
0  Lee     A    100
2  Kim     B     90

- 여러 행과 여러 열 검색

In [68]:
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

In [69]:
df.loc[0:2, ['score', 'grade']]

   score grade
0    100     A
1     95     A
2     90     B

### 3) iloc[인덱스, 컬럼인덱스] - 위치(position) 기반 인덱싱

In [70]:
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

- 하나의 행 검색

In [71]:
df.iloc[3]

name     Choi
grade       B
score      85
Name: 3, dtype: object

- 여러 행 검색

In [72]:
df.iloc[0:3]

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90

- 여러 행과 여러 열 검색

In [73]:
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

In [74]:
df.iloc[0:3, 0:2]

    name grade
0    Lee     A
1  Hwang     A
2    Kim     B

### 4) 불린(Boolean) 인덱싱

In [75]:
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

In [76]:
df[df['score'] > 90]

    name grade  score
0    Lee     A    100
1  Hwang     A     95

In [77]:
df.loc[df['score'] > 90]

    name grade  score
0    Lee     A    100
1  Hwang     A     95

In [78]:
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

In [79]:
df[df['grade'] == 'B']

   name grade  score
2   Kim     B     90
3  Choi     B     85

In [80]:
df.loc[df['grade'] == 'B']

   name grade  score
2   Kim     B     90
3  Choi     B     85

### 5) filter() 함수를 이용한 검색

- filter() 함수

In [81]:
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

In [82]:
# shift + Tab
df.filter(items=['name', 'score'])

    name  score
0    Lee    100
1  Hwang     95
2    Kim     90
3   Choi     85

In [83]:
df.filter(like='g', axis=1) # 컬럼명에 'g'가 포함된 컬럼 출력

  grade
0     A
1     A
2     B
3     B

In [84]:
df.filter(like='a', axis=1) # 컬럼명에 'a'가 포함된 컬럼 출력

    name grade
0    Lee     A
1  Hwang     A
2    Kim     B
3   Choi     B

In [85]:
# 도움말
df.filter?

Signature:
df.filter(
    items=None,
    like: 'str | None' = None,
    regex: 'str | None' = None,
    axis: 'Axis | None' = None,
) -> 'Self'
Docstring:
Subset the dataframe rows or columns according to the specified index labels.

Note that this routine does not filter a dataframe on its
contents. The filter is applied to the labels of the index.

Parameters
----------
items : list-like
    Keep labels from axis which are in items.
like : str
    Keep labels from axis for which "like in label == True".
regex : str (regular expression)
    Keep labels from axis for which re.search(regex, label) == True.
axis : {0 or 'index', 1 or 'columns', None}, default None
    The axis to filter on, expressed either as an index (int)
    or axis name (str). By default this is the info axis, 'columns' for
    DataFrame. For `Series` this parameter is unused and defaults to `None`.

Returns
-------
same type as input object

See Also
--------
DataFrame.loc : Access a group of rows and columns
    by label(s) or a boolean array.

Notes
-----
The ``items``, ``like``, and ``regex`` parameters are
enforced to be mutually exclusive.

``axis`` defaults to the info axis that is used when indexing
with ``[]``.

Examples
--------
>>> df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
...                   index=['mouse', 'rabbit'],
...                   columns=['one', 'two', 'three'])
>>> df
        one  two  three
mouse     1    2      3
rabbit    4    5      6

>>> # select columns by name
>>> df.filter(items=['one', 'three'])
         one  three
mouse     1      3
rabbit    4      6

>>> # select columns by regular expression
>>> df.filter(regex='e$', axis=1)
         one  three
mouse     1      3
rabbit    4      6

>>> # select rows containing 'bbi'
>>> df.filter(like='bbi', axis=0)
         one  two  three
rabbit    4    5      6
File:      c:\users\kosmo\appdata\local\programs\python\python311\lib\site-packages\pandas\core\generic.py
Type:      method

- 정규식을 이용한 filter() 함수

In [86]:
df

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

In [87]:
df.filter(regex='^n', axis=1)

    name
0    Lee
1  Hwang
2    Kim
3   Choi

In [88]:
df.filter(regex='e$', axis=1)

    name grade  score
0    Lee     A    100
1  Hwang     A     95
2    Kim     B     90
3   Choi     B     85

## DataFrame 데이터 추가

In [89]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
      'score':[100, 95, 80, 85],
      'grade':['A', 'A', 'B', 'B']}
df = pd.DataFrame(data)
df

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     80     B
3   Choi     85     B

### 1) Serial 객체를 이용하여 열 데이터 추가

In [90]:
points = pd.Series([1.5, 1.7, 2.4, 3.0], index=[0, 1, 2, 3])
points

0    1.5
1    1.7
2    2.4
3    3.0
dtype: float64

In [91]:
df['points'] = points
df

    name  score grade  points
0    Lee    100     A     1.5
1  Hwang     95     A     1.7
2    Kim     80     B     2.4
3   Choi     85     B     3.0

In [92]:
points2 = pd.Series([1.5, 1.7, 2.4], index=[3,1,0])
points2

3    1.5
1    1.7
0    2.4
dtype: float64

In [93]:
df['points2'] = points2
df

    name  score grade  points  points2
0    Lee    100     A     1.5      2.4
1  Hwang     95     A     1.7      1.7
2    Kim     80     B     2.4      NaN
3   Choi     85     B     3.0      1.5

### 2) numpy 함수를 이용하여 열 데이터 추가

In [94]:
df

    name  score grade  points  points2
0    Lee    100     A     1.5      2.4
1  Hwang     95     A     1.7      1.7
2    Kim     80     B     2.4      NaN
3   Choi     85     B     3.0      1.5

In [95]:
import numpy as np

In [96]:
np.zeros(4).astype(int)

array([0, 0, 0, 0])

In [97]:
df['etc'] = np.zeros(4).astype(int)
df

    name  score grade  points  points2  etc
0    Lee    100     A     1.5      2.4    0
1  Hwang     95     A     1.7      1.7    0
2    Kim     80     B     2.4      NaN    0
3   Choi     85     B     3.0      1.5    0

### 3) 연산을 통해 열 데이터 추가

In [98]:
df

    name  score grade  points  points2  etc
0    Lee    100     A     1.5      2.4    0
1  Hwang     95     A     1.7      1.7    0
2    Kim     80     B     2.4      NaN    0
3   Choi     85     B     3.0      1.5    0

In [99]:
df['score'] > 90

0     True
1     True
2    False
3    False
Name: score, dtype: bool

In [100]:
df['pass'] = df['score'] > 90
df

    name  score grade  points  points2  etc   pass
0    Lee    100     A     1.5      2.4    0   True
1  Hwang     95     A     1.7      1.7    0   True
2    Kim     80     B     2.4      NaN    0  False
3   Choi     85     B     3.0      1.5    0  False

### 4) loc() 함수를 이용하여 행 데이터 추가

In [101]:
df

    name  score grade  points  points2  etc   pass
0    Lee    100     A     1.5      2.4    0   True
1  Hwang     95     A     1.7      1.7    0   True
2    Kim     80     B     2.4      NaN    0  False
3   Choi     85     B     3.0      1.5    0  False

In [102]:
df.loc[5, :] = ['Park', 70, 'C', 1.0, np.NaN, 0, False]
df

AttributeError: `np.NaN` was removed in the NumPy 2.0 release. Use `np.nan` instead.

In [ ]:
df = df.reset_index(drop=True)
df

## DataFrame 데이터 삭제 
### 1) drop
- DataFrame.drop(labels=None, axis=0, index=None, columns=None, inplace=False)

In [ ]:
df

In [ ]:
df.drop(index=4) # 실제로 삭제 X

In [ ]:
df.drop(index=4, inplace=True ) # 실제로 삭제

In [ ]:
df

In [ ]:
df.drop('etc', axis=1)

In [ ]:
df.drop('etc', axis=1, inplace=True)
df

In [ ]:
df

In [ ]:
df2 = df.drop('points2', axis=1)

In [ ]:
df

In [ ]:
df2

### 2) del
- del df['컬럼명']

In [ ]:
df

In [ ]:
del df['points2'] # 주의 : 실제로 삭제
df

## 집합(Aggregation) 함수
- sum(), max(), min(), count() 등의 집합(Aggregation) 함수로 연산 수행

In [ ]:
import pandas as pd

In [ ]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
      'score':[100, 95, 80, 85],
      'point':[3.4, 2.3, 4.0, 1.9],
      'grade':['A', 'A', 'B', 'B']}

df = pd.DataFrame(data)
df

In [ ]:
df.sum()

In [ ]:
df.mean()

In [ ]:
df.max()

In [ ]:
df.min()

In [ ]:
df.describe()

### 하나의 컬럼에 집합 함수 적용

In [ ]:
df

In [ ]:
df.score

In [ ]:
df.score.mean()

In [ ]:
df['score'].mean()

In [ ]:
df.loc[:, 'score'].mean()

In [ ]:
df.iloc[:, 1].mean()

### 여러 컬럼에 집합 함수 적용

In [ ]:
df[['score', 'point']]

In [ ]:
df[['score', 'point']].sum(axis=0)

In [ ]:
df

In [ ]:
df[['score', 'point']].sum(axis=1)

## DataFrame 정렬

In [ ]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
      'score':[100, 95, 80, 85],
      'grade':['A', 'A', 'B', 'B']}
df = pd.DataFrame(data)
df

### 1) index 순으로 정렬 : sort_index()

In [ ]:
df.sort_index(axis=0) # 인덱스 순으로 정렬

In [ ]:
df.sort_index(axis=0, ascending=False) # 인덱스 순으로 정렬

In [ ]:
df.sort_index(axis=1) # 컬럼순(오름차순)으로 정렬

In [ ]:
df.sort_index(axis=1, ascending=False) # 컬럼순(내림차순)으로 정렬

### 2) 지정된 컬럼의 컬럼값 순으로 정렬 : sort_values(by=['컬럼명', ...])

In [ ]:
df

In [ ]:
# 오름차순 정렬
df.sort_values(by=['score'])

In [ ]:
# 내림차순 정렬
df.sort_values(by=['score'], ascending=False)

In [ ]:
# 2개 이상의 컬럼값으로 정렬
df.sort_values(by=['grade','score'])

In [ ]:
# 2개 이상의 컬럼값으로 정렬
df.sort_values(by=['grade','score'], ascending=[True, False])

## 결손 데이타(Missing Data) 처리
- 1) isna() 또는 isnull() : 주어진 컬럼 값들이 NaN인지 확인
- 2) fillna() : NaN 데이터를 찾아 value로 지정된 값으로 변환 
- 3) dropna() : 행 데이터를 기준으로 NaN 값이 포함된 데이터를 제거

In [ ]:
df

### NaN 값을 가진 컬럼 추가

In [ ]:
df['point'] = np.nan
df

### 1) NaN 값 체크 : df.isnull(), df.isna()

In [ ]:
df.isna()

In [ ]:
df.isnull()

### 2) df.fillna()

- point 컬럼을 0으로 채우기

In [ ]:
df.fillna(value = 0, inplace=True)
df

- point2 컬럼 추가

In [ ]:
df['point2'] = [50, 100, 70, np.nan]
df

- point2 컬럼의 NaN에 평균값으로 채우기

In [ ]:
df['point2'].mean()

In [ ]:
df.fillna(value=df['point2'].mean()

In [ ]:
df

### 3) df.dropna()

In [ ]:
df

In [ ]:
df.dropna(how='any')

In [ ]:
df

In [ ]:
df.dropna(how='all')